docs: update README.md
